/*Тема: задача з рівними дільниками
Натуральне число m називається рівним дільником числа n,
якщо частка і залишок від ділення n на m дорівнюють одне одному.
Для заданого натурального числа n знайти кількість його рівних дільників.
Вхідні дані: Натуральне число n (1 < n < 150).
Вихідні дані: Вивести одне шукане число.*/
#include <stdio.h>
int main() {
    int n;
    printf("Введіть натуральне число n (1 < n < 150): ");
    scanf("%d", &n);
    if (n <= 1 || n >= 150) {
        printf("Число має бути в діапазоні 1 < n < 150.\n");
        return 1;
    }
    int count = 0;
    for (int m = 1; m <= n; m++) {
        if (n % m == n / m) {
            count++;
        }
    }
    printf("Кількість рівних дільників %d дорівнює: %d\n", n, count);
    return 0;
}
